# 1 - Задайте натуральное число N. Напишите программу, которая составит
# список простых множителей числа N.
# N = 20 -> [2, 2, 5]
# N = 30 -> [2, 3, 5]
"""
    Функция составит список простых множителей числа N
    Args:
        int
    Returns:
        list

"""
# def list_of_prime_factors(n: int) -> list:

#   n = int(input("Введите число: "))
#   i = 2
#   list = []
#   while i <= n:

#     if (n % i == 0):
#         list.append(i)
#         n //= i
#     else:
#         i += 1
        
#   print(list)




# Задача №32: Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов
#  исходной последовательности.
# [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]

'''
    
    Функция выведет список неповторяющися элементов 
    исходной последовательности

    Args:
        list
    Returns:
        list

'''


# def list_of_nonrepeating_elements():

#   some_list = list(map(int, input("Введите числа через пробел: " ).split()))
#   print(set(some_list))

# list_of_nonrepeating_elements()


